{
  "backend/main.mo": "Defines all core data types for perks, characters, builds, matches, news, and user data, plus helper modules for storing match history and favorites using List conversions.",
  "feature_evidence.json": "Lists feature evidence records mapping implemented features to their related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Defines global Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, defines all main routes, and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/AppLayout.tsx": "Provides the global layout with header, navigation, background, auth controls, and optional profile setup modal.",
  "frontend/src/components/Auth/AuthGate.tsx": "Displays a login-required screen for unauthenticated users and renders children only when authenticated.",
  "frontend/src/components/Auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication with loading and error-recovery logic.",
  "frontend/src/components/Auth/ProfileSetupModal.tsx": "Displays a modal for users to enter and save their display name using a profile save mutation.",
  "frontend/src/components/EmptyState.tsx": "Reusable empty-state component showing an icon, title, optional description, and optional action.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, refetching dependent queries on actor changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides hooks to fetch and save the authenticated user's profile through the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity auth, exposing identity state, login, logout, and status via context.",
  "frontend/src/hooks/useQueries.ts": "Collection of data-fetching and mutation hooks for characters, perks, news, wiki entries, and user data via the actor.",
  "frontend/src/index.css": "Tailwind base configuration defining theme CSS variables and global styles.",
  "frontend/src/main.tsx": "App entry initializing React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/BuildPlannerPage.tsx": "Build planner UI allowing users to create, edit, and delete builds tied to their saved user data.",
  "frontend/src/pages/CharactersPage.tsx": "Characters listing page with search, role filters, and ability to favorite characters.",
  "frontend/src/pages/MatchTrackerPage.tsx": "Page for viewing, adding, and deleting match history entries using user data and character lists.",
  "frontend/src/pages/NewsPage.tsx": "Displays searchable news items with selectable detail view and category badges.",
  "frontend/src/pages/PerksPage.tsx": "Lists all perks with search, detail view, and ability to favorite perks tied to user data.",
  "frontend/src/pages/ProfilePage.tsx": "Shows user profile info and stats with links to builds and match history.",
  "frontend/src/pages/WikiPage.tsx": "Displays searchable wiki entries and shows selected entry details.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from hash-based routes.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, container settings, animations, and plugin setup.",
  "project_state.json": "Project metadata describing app scope, architecture, features, and image requirements for a Dead by Daylight companion app."
}